CodeIgniter4/app/Controllers/ReportController.php

    public function deleteReport($id = null)
    {
        // Cari laporan berdasarkan ID
        $report = $this->model->find($id);

        if (!$report) {
            return $this->failNotFound("Report not found.");
        }

        // Hapus file foto jika ada
        if (!empty($report['photo']) && file_exists(FCPATH . $report['photo'])) {
            unlink(FCPATH . $report['photo']); // Hapus file dari server
        }

        // Hapus laporan dari database
        if ($this->model->delete($id)) {
---
DELETE FROM `reports`
WHERE `id` IN ('4')